### pandas 라이브러리
- 행과 열을 기준으로 생성된 테이블형 데이터를 효율적으로 다룰 수 있게 도와주는 파이썬 라이브러리
- EDA와 연계해서 학습을 하면 시너지 효과
- pandas 라이브러리 : 데이터를 2가지 타입으로 분류 (시리즈 / 데이터프레임)
- Series : 1개의 컬럼으로 구성된 데이터 = 1차원 데이터 = []
- Dataframe : 2개 이상의 컬럼으로 구성 = 2개 이상의 시리즈로 구성된 데이터 = 2차원 데이터 = [[]]
- CRUD = Create Read Update Delete => 대부분의 프로그래밍 언어 4가지 기본 기능 => 위주로 학습 => +@
- 데이터 분야에서 무언가를 인덱스로 만들어 놓는다는 것은 해당 인덱스 값을 기준으로 빠르게 밸류값을 찾아오겠다는 의미를 내포!!!
- 시리즈 데이터를 생성할 때, 해당 데이터 안에 입력될 수 있는 자료형 굉장히 중요함!!!
- 방대한 데이터를 관리 => 일관성있는 데이터 형태가 유지되어야 함 기본전제 => 10만개 => 특정 번째 열의 데이터만 평균 // 더하기 // 제곱
- 문자, 정수, 실수, 논리형 : 1 + "문자" + True
- Null // NaN => 결측치 => 오류!!! =>
- 시리즈에서 데이터의 타입
  - int64 : 64비트 분량의 정수 데이터를 저장
  - object : 문자열 | 여러가지 데이터 혼합되어있는 경우
  - float64 : 64비트 분량의 실수 데이터를 저장
  - bool : True 또는 False 형태의 불리언 데이터
  - datetime64 : 날짜/시간 형태의 데이터

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

seriesdata = pd.Series([70, 60, 90])
seriesdata

0    70
1    60
2    90
dtype: int64

In [2]:
seriesdata = pd.Series([70, 60, 90], index=["국어", "영어", "수학"])
seriesdata

국어    70
영어    60
수학    90
dtype: int64

In [3]:
seriesdata.index

Index(['국어', '영어', '수학'], dtype='object')

In [4]:
seriesdata.index = ['미술', '음악', '체육']

In [6]:
seriesdata

미술    70
음악    60
체육    90
dtype: int64

In [7]:
seriesdata.values

array([70, 60, 90])

In [10]:
print(seriesdata["미술"], seriesdata.iloc[0])
print(seriesdata["음악"], seriesdata.iloc[1])
print(seriesdata["체육"], seriesdata.iloc[2])

70 70
60 60
90 90

In [11]:
seriesdata["미술"] = 80

In [12]:
print(seriesdata["미술"], seriesdata.iloc[0])
print(seriesdata["음악"], seriesdata.iloc[1])
print(seriesdata["체육"], seriesdata.iloc[2])

80 80
60 60
90 90

In [13]:
del seriesdata["미술"]

In [14]:
seriesdata

음악    60
체육    90
dtype: int64

In [15]:
import pandas as pd

seriesdata02 = pd.Series(["dave", "alex", "david"])
seriesdata02

0     dave
1     alex
2    david
dtype: object

In [16]:
import pandas as pd

seriesdata03 = pd.Series(["dave", 1, 1.5])
seriesdata03

0    dave
1       1
2     1.5
dtype: object

In [17]:
import pandas as pd

seriesdata04 = pd.Series([1, 2, 3])
seriesdata04

0    1
1    2
2    3
dtype: int64

In [18]:
seriesdata04.astype("float")

0    1.0
1    2.0
2    3.0
dtype: float64

In [19]:
import pandas as pd

seriesdata05 = pd.Series([True, False, True])
seriesdata05

0     True
1    False
2     True
dtype: bool

In [20]:
import pandas as pd

df = pd.DataFrame({
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.5, 0.45],
    "중국": [10, 13, 15]
})

df

    미국    한국  중국
0  2.1  0.40  10
1  2.2  0.50  13
2  2.3  0.45  15

In [21]:
import pandas as pd

df = pd.DataFrame({
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.5, 0.45],
    "중국": [10, 13, 15]
}, index=[2000, 2010, 2020])

df

       미국    한국  중국
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [22]:
df.index

Index([2000, 2010, 2020], dtype='int64')

In [24]:
df.index = [2001, 2002, 2003]

In [39]:
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [26]:
df.columns

Index(['미국', '한국', '중국'], dtype='object')

In [27]:
df.columns = ["일본", "필리핀", "러시아"]

In [28]:
df

       일본   필리핀  러시아
2001  2.1  0.40   10
2002  2.2  0.50   13
2003  2.3  0.45   15

In [29]:
df.columns

Index(['일본', '필리핀', '러시아'], dtype='object')

In [30]:
df.values

array([[ 2.1 ,  0.4 , 10.  ],
       [ 2.2 ,  0.5 , 13.  ],
       [ 2.3 ,  0.45, 15.  ]])

In [6]:
import pandas as pd

df = pd.DataFrame({
    "년도": [2000, 2010, 2020],
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.5, 0.45],
    "중국": [10, 13, 15]
})

df

     년도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.50  13
2  2020  2.3  0.45  15

In [7]:
df = df.set_index("년도")

In [8]:
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [9]:
df = df.reset_index("년도")
df

     년도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.50  13
2  2020  2.3  0.45  15

In [16]:
df = df.set_index("년도")
df
# df.index.name

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [17]:
df.index.name

'년도'

In [14]:
df = df.reset_index("년도")
df

     년도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.50  13
2  2020  2.3  0.45  15

In [15]:
df.index.name

In [18]:
df.index.name = "연도"
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [19]:
df.loc[2000]

미국     2.1
한국     0.4
중국    10.0
Name: 2000, dtype: float64

In [20]:
df.iloc[0]

미국     2.1
한국     0.4
중국    10.0
Name: 2000, dtype: float64

In [21]:
type(df.loc[2000])

pandas.core.series.Series

In [24]:
print(df["미국"][2000])

2.1

In [28]:
print(df.loc[2000]["미국"])

2.1

In [ ]:
# CRU

In [29]:
df["일본"] = [1, 2, 3]

In [30]:
df

       미국    한국  중국  일본
연도
2000  2.1  0.40  10   1
2010  2.2  0.50  13   2
2020  2.3  0.45  15   3

In [31]:
del df["일본"]
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [32]:
df.loc[2021] = [1, 2, 3]

In [35]:
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15
2021  1.0  2.00   3

In [36]:
df.drop([2021])

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [38]:
df = df.drop([2021])

In [40]:
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [ ]:
# 데이터를 다룰 때, 원본 데이터 중요함 강조 = raw data = backup /

In [41]:
df2 = df[["중국", "한국"]].copy()

In [42]:
df2

      중국    한국
연도
2000  10  0.40
2010  13  0.50
2020  15  0.45

In [43]:
df2.columns = ["브라질", "아르헨티나"]

In [44]:
df2

      브라질  아르헨티나
연도
2000   10   0.40
2010   13   0.50
2020   15   0.45

In [45]:
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15